<?php

use Illuminate\Database\Seeder;

class MembersTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $members = [
            ['098001', '松井 武志'],
            ['098002', '小野寺 和幸'],
            ['099001', '河原 隆博'],
            ['099002', '深堀 芳久'],
            ['201001', '宮前 孝典'],
            ['201002', '松野 和義'],
            ['202001', '中村 草太'],
            ['202002', '宮元 綾美'],
            ['203001', '小堂 祥三'],
            ['203002', '茂垣 伊代'],
            ['204001', '川合 英司'],
            ['204002', '小海 花梨'],
            ['205001', '坂林 花恵'],
            ['205002', '茂垣 伊代'],

            /*['206001', '宮元 綾美'],
            ['206002', '小堂 祥三'],
            ['206003', '茂垣 伊代'],
            ['206004', '川合 英司'],
            ['206005', '小海 花梨'],
            ['206006', '坂林 花恵'],
            ['206007', '茂垣 伊代'],
            ['206008', '小海 花梨'],
            ['206009', '坂林 花恵'],
            ['206010', '茂垣 伊代'],

            ['207001', '宮元 綾美'],
            ['207002', '小堂 祥三'],
            ['207003', '茂垣 伊代'],
            ['207004', '川合 英司'],
            ['207005', '小海 花梨'],
            ['207006', '坂林 花恵'],
            ['207007', '茂垣 伊代'],
            ['207008', '小海 花梨'],
            ['207009', '坂林 花恵'],
            ['207010', '茂垣 伊代'],

            ['208001', '宮元 綾美'],
            ['208002', '小堂 祥三'],
            ['208003', '茂垣 伊代'],
            ['208004', '川合 英司'],
            ['208005', '小海 花梨'],
            ['208006', '坂林 花恵'],
            ['208007', '茂垣 伊代'],
            ['208008', '小海 花梨'],
            ['208009', '坂林 花恵'],
            ['208010', '茂垣 伊代'],

            ['209001', '宮元 綾美'],
            ['209002', '小堂 祥三'],
            ['209003', '茂垣 伊代'],
            ['209004', '川合 英司'],
            ['209005', '小海 花梨'],
            ['209006', '坂林 花恵'],
            ['209007', '茂垣 伊代'],
            ['209008', '小海 花梨'],
            ['209009', '坂林 花恵'],
            ['209010', '茂垣 伊代'],

            ['210001', '宮元 綾美'],
            ['210002', '小堂 祥三'],
            ['210003', '茂垣 伊代'],
            ['210004', '川合 英司'],
            ['210005', '小海 花梨'],
            ['210006', '坂林 花恵'],
            ['210007', '茂垣 伊代'],
            ['210008', '小海 花梨'],
            ['210009', '坂林 花恵'],
            ['210010', '茂垣 伊代'],

            ['211001', '宮元 綾美'],
            ['211002', '小堂 祥三'],
            ['211003', '茂垣 伊代'],
            ['211004', '川合 英司'],
            ['211005', '小海 花梨'],
            ['211006', '坂林 花恵'],
            ['211007', '茂垣 伊代'],
            ['211008', '小海 花梨'],
            ['211009', '坂林 花恵'],
            ['211010', '茂垣 伊代'],

            ['212001', '宮元 綾美'],
            ['212002', '小堂 祥三'],
            ['212003', '茂垣 伊代'],
            ['212004', '川合 英司'],
            ['212005', '小海 花梨'],
            ['212006', '坂林 花恵'],
            ['212007', '茂垣 伊代'],
            ['212008', '小海 花梨'],
            ['212009', '坂林 花恵'],
            ['212010', '茂垣 伊代'],*/
        ];
        $teams = DB::table('teams')->get();
        $team_size = count($teams);
        
        $data = [];
        foreach ($members as $member) {
            $data[] = [
                'id'      => $member[0],
                'name'    => $member[1],
                # ランダムにチームを振り分け
                'team_id' => $teams[rand(0, $team_size - 1)]->id
            ];
        }
        DB::table('members')->insert($data);
    }
}
